In [1]:
import pandas as pd

### Exercício 02

> Manipulando dados com Pandas

* a) Crie um programa em pandas para ler o arquivo em Excel imobiliária.xlsx

In [2]:
document_path = "./Imobiliária.xlsx"

* b) e coloque em um dataframe.

In [3]:
dataframe = pd.read_excel(document_path)

* c) Visualize o cabeçalho dos dados;

In [4]:
dataframe.head(4)

,Coluna 1,Coluna 2,Coluna 3,Coluna 4,Coluna 5,Coluna 6,Coluna 7,Coluna 8,Coluna 8.1,Coluna 10
0,Centro,Simone,2005-10-08,Apartamento,102.5,2,2,Sim,235500,3532.5
1,Noroeste,Simone,2005-10-08,Apartamento,199.5,4,4,Não,377700,5665.5
2,Norte,Roberto,2005-10-12,Casa,145.5,2,2,Não,232500,3487.5
3,Sudeste,Simone,2005-10-14,Apartamento,153.5,3,2,Não,289100,4336.5

* d) Visualize as últimas linhas;

In [5]:
dataframe.tail()

,Coluna 1,Coluna 2,Coluna 3,Coluna 4,Coluna 5,Coluna 6,Coluna 7,Coluna 8,Coluna 8.1,Coluna 10
1113,Sudeste,Simone,2011-03-20,Apartamento,74.5,2,2,Não,224400,3366.0
1114,Norte,João Carlos,2011-03-21,Apartamento,192.0,4,4,Não,361000,5415.0
1115,Leste,Simone,2011-03-27,Apartamento,42.0,1,1,Sim,167900,2518.5
1116,Oeste,Simone,2011-03-28,Apartamento,100.5,2,2,Sim,227600,3414.0

* e) Escreva um programa para renomear o cabeçalho da tabela com os seguintes nomes:

In [6]:
dataframe.columns = [
    'Filial',
    'Vendedor',
    'Data',
    'Tipo',
    'Área (m²)',
    'Dorms.',
    'Garag.',
    'Piscina',
    'Preço',
    'Comissão'
]

dataframe.head()

,Filial,Vendedor,Data,Tipo,Área (m²),Dorms.,Garag.,Piscina,Preço,Comissão
0,Centro,Simone,2005-10-08,Apartamento,102.5,2,2,Sim,235500,3532.5
1,Noroeste,Simone,2005-10-08,Apartamento,199.5,4,4,Não,377700,5665.5
2,Norte,Roberto,2005-10-12,Casa,145.5,2,2,Não,232500,3487.5
3,Sudeste,Simone,2005-10-14,Apartamento,153.5,3,2,Não,289100,4336.5
4,Noroeste,Cristina,2005-10-16,Apartamento,93.0,2,2,Sim,235400,3531.0

* g) 5. Quais são os tipos de dados que temos no dataframe?

In [7]:
dataframe.dtypes

Filial               object
Vendedor             object
Data         datetime64[ns]
Tipo                 object
Área (m²)           float64
Dorms.                int64
Garag.                int64
Piscina              object
Preço                 int64
Comissão            float64
dtype: object

* h) 6. Há valores faltantes ou nulos?

In [11]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1117 entries, 0 to 1116
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Filial     1117 non-null   object
 1   Vendedor   1117 non-null   object
 2   Data       1117 non-null   datetime64[ns]
 3   Tipo       1117 non-null   object
 4   Área (m²)  1117 non-null   float64
 5   Dorms.     1117 non-null   int64
 6   Garag.     1117 non-null   int64
 7   Piscina    1117 non-null   object
 8   Preço      1117 non-null   int64
 9   Comissão   1117 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(3), object(4)
memory usage: 87.4+ KB

* i) 7. Calcule a soma, média, máximo, mínimo e contagem da coluna Preço.

In [24]:
print(f"Soma da coluna preço: R$ {dataframe['Preço'].sum():,.0f}")
print(f"Média da coluna preço: R$ {dataframe['Preço'].mean():,.0f}")
print(f"Valor mínimo da coluna preço: R$ {dataframe['Preço'].min():,.0f}")
print(f"Valor máximo da coluna preço: R$ {dataframe['Preço'].max():,.0f}")
print(f"Contagem da coluna preço: {dataframe['Preço'].count()}")

Soma da coluna preço: R$ 295,035,000
Média da coluna preço: R$ 264,132
Valor mínimo da coluna preço: R$ 145,100
Valor máximo da coluna preço: R$ 384,300
Contagem da coluna preço: 1117

* j) 8. Crie um programa para criar um dataframe para mostrar as vendas por região, e salvar um arquivo em Excel para cada região.

Centro; Noroeste; Norte; Sudeste; Oeste; Leste; Sudoeste; Sul; Nordeste

In [27]:
# Gerar um relatório de vendas da região CENTRO

# Filtrar os dados
end_dataframe = dataframe[dataframe['Filial'] == 'Centro']

# Mapear o caminho final e definir um nome para o arquivo
output_path = "./filiais/"
arq_name = 'centro.xlsx'

# Salvar o arquivo na pasta
end_dataframe.to_excel(output_path + arq_name)

In [28]:
lista = ['Centro', 'Noroeste', 'Norte', 'Sudeste', 'Oeste', 'Leste', 'Sudoeste', 'Sul', 'Nordeste']

for i in lista:

    dataframe[dataframe['Filial'] == i].to_excel(output_path + f'{i.lower()}.xlsx')